stressTesting/dev_test.yaml
config:
  target: "http://localhost:3001"
  phases:
    - duration: 60
      arrivalRate: 10
      rampTo: 100
    # - duration: 30
    #   arrivalRate: 100
    #   rampTo: 25
    # - duration: 90
    #   arrivalRate: 25
    #   rampTo: 100
    # - duration: 180
    #   arrivalRate: 100
    #   rampTo: 500
scenarios:
  - name: "get random track"
    flow:
        - get:
            url: "/relatedTracks/{{ $randomNumber(1, 10000000) }}"
        - get:
            url: "/relatedTracks/{{ $randomNumber(9000000, 10000000) }}"
        # - post:
        #     url: "/relatedTracks/add"
        #     headers:
        #       Content-type: "application/json"
        #     body: '{"genre":11578,"producer":22046}'